*** Multiple tests               :in set():
#+begin_src python :results output
  from enum import Enum
  class Moves(Enum): West=1; East=2; North=3; South=4;

  def whichmove(m):
      if m in { Moves.West, Moves.East, Moves.North, Moves.South }:
          print("That's a direct move.")
      else:
          print("That's a diagonal move.")

  whichmove(Moves.West)
  whichmove(5)
#+end_src

#+RESULTS:
: That's a direct move.
: That's a diagonal move.

*** String formatting            :string.format():
#+begin_src python :results output
  name = "Micheal"
  age  = 43

  print("Hi, I'm {1:d} years old and my name is {0:s}.".format(name, age))
  
  data = {'name':'Micheal', 'age':43}
  print("Hi, I'm {age} years old and my name is {name}.".format(**data))
  print(f"Hi, I'm {age} years old and my name is {name}.") # python3.6
#+end_src

#+RESULTS:
: Hi, I'm 43 years old and my name is Micheal.
: Hi, I'm 43 years old and my name is Micheal.
: Hi, I'm 43 years old and my name is Micheal.

*** Merging dictionaries         :**dict:
#+begin_src python :results output
  route = {'id': 271, }
  query = {'id': 1, 'word': 'select'}
  post = {'email': 'abc@123.com', 'name': 'Jeff'}

  ml = {**query, **post, **route}
  print(ml)
#+end_src

#+RESULTS:
: {'id': 271, 'word': 'select', 'email': 'abc@123.com', 'name': 'Jeff'}
*** Custom type iteration        :yield it:
    yield 与类内部魔法方法 =__next__= 相同，python 中 for 循环的本质即将列表转化
为 iter 对象后重复调用 nex() 直到 =StopIteration= Exception。
    #+begin_src python :results output
      class ShoppingCart:
          def __init__(self):
              self.items = []

          def add_item(self, it):
              self.items.append(it)

          def __iter__(self):
              for it in sorted(self.items, key=lambda i: i['price']):
                  yield it

      cart = ShoppingCart()
      cart.add_item({'name':"guitar", 'price':799})
      cart.add_item({'name':"cd",     'price':19})
      cart.add_item({'name':"iPhone", 'price':699})

      for item in cart:
          print('{} for ${}'.format(item['name'], item['price']))
    #+end_src

    #+RESULTS:
    : cd for $19
    : iPhone for $699
    : guitar for $799

    #+begin_src python :results output
      def fibonacci_generator():
          current, nxt = 0, 1
          while True:
              current, nxt = nxt, nxt + current
              yield current

      i = 0
      for item in fibonacci_generator():
          i += 1
          if i > 5: break
          print(item, end=' ')
    #+end_src

    #+RESULTS:
    : 1 1 2 3 5 
    
    #+begin_src python
      import os
      def get_files(folder):
          for item in os.listdir(folder):
              full_item = os.path.join(folder, item)
              if os.path.isfile(full_item):
                  yield full_item
              elif os.path.isdir(full_item):
                  yield from get_files(full_item)
    #+end_src

*** Data hiding                  :__, _:
    #+begin_src python :results output
      class PetSnake:
          def __init__(self, name, age):
              self.__age = age
              self.__name = name			# Double _'s mean private.
              self._protected = True  # Single _'s mean protected.

          @property
          def name(self):
            return self.__name

          @property
          def age(self):
            return self.__age

      py = PetSnake("Slide", 6)
      print("She is named {} and {} years old."
            .format(py.name, py.age))
    #+end_src

    #+RESULTS:
    : She is named Slide and 6 years old.
*** Numerical loop               :enumerate():
    #+begin_src python :results output
      data = [1, 7, 11]

      for idx, val in enumerate(data):
          print(" {} --> {}".format(idx, val)) 
    #+end_src

    #+RESULTS:
    :  0 --> 1
    :  1 --> 7
    :  2 --> 11
*** Named tuples                 :collections.namedtuple:
#+begin_src python :results output
  import collections
  Measurement = collections.namedtuple(
      'Measurement',
      'temp, lat, long, quality')

  m = Measurement(22.5, 44.234, 19.02, 'strong')

  temp = m[0]
  temp = m.temp
  quality = m.quality

  print(m)
#+end_src

#+RESULTS:
: Measurement(temp=22.5, lat=44.234, long=19.02, quality='strong')

**** 打印十六进制
    #+begin_src python :results output
      import string
      def print_hex(bytes):
          l = [int(i) for i in bytes]
          for i in range(0, len(l), 16):
              rest = len(l) - i if len(l) - i < 16 else 16
              for j in range(rest):
                  print("{:02X}".format(l[i+j]), end=' ')
              print("   " * (16-rest) + "\t", end='')
              for j in range(rest):
                  print(chr(l[i+j]) if chr(l[i+j]) in string.printable[:-5] else '.', end='')
              print("")

      s = b"test\x00\x01\x02\x03"
      print_hex(s)
    #+end_src

    #+RESULTS:
    : 74 65 73 74 00 01 02 03                         	test....
*** 尾递归
    用 selenium 时遇到网页回退会刷新页面中元素的 guid 导致无法递归，采用尾递归。模型如下：
#+begin_src python :results output
  lll = {
      'a': [1, 2, 3],
      'b': {'ba': [4, 5], 'bb': [6, 7]},
      'c': [8],
      }

  def get_next_dir(l, finished):
      if isinstance(l, list):
          return None
      for item in l.keys():
          if item in finished:
              pass
          else:
              return item
      return None

  def down_files(l, finished=None):
      if finished is None:
          finished = []

      if l is None:
          return

      if isinstance(l, list):
          print("download {}".format(l))

      next_dir = get_next_dir(l, finished)
      while next_dir:
          print("cd {}".format(next_dir))
          down_files(l[next_dir])
          finished.append(next_dir)
          print("finished: {}".format(finished))
          next_dir = get_next_dir(l, finished)

  down_files(lll)
#+end_src

#+RESULTS:
#+begin_example
cd a
download [1, 2, 3]
finished: ['a']
cd b
cd ba
download [4, 5]
finished: ['ba']
cd bb
download [6, 7]
finished: ['ba', 'bb']
finished: ['a', 'b']
cd c
download [8]
finished: ['a', 'b', 'c']
#+end_example

** 自己输出自己
#+begin_src python :results output
  s='s=%r;print(s%%s)';print(s%s)
#+end_src

#+RESULTS:
: s='s=%r;print(s%%s)';print(s%s)
